tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/0/topAir/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            fixedValue;
        value           $internalField;
    }
    maxX
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    "(min|max)(Y|Z)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    "topAir_to_.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
